Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/edc/PIC32MM0064GPM064.PIC
      <edc:SFRDef edc:_addr="0x1F802220" edc:_begin="0x0" edc:_end="0x160" edc:_modsrc="DOS-02805_adc_sib_upb_v1_32bit.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADC1BUF18" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADC1BUF18" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADC1BUF18" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="ADC1BUF18" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802230" edc:_begin="0x0" edc:_end="0x160" edc:_modsrc="DOS-02805_adc_sib_upb_v1_32bit.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADC1BUF19" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADC1BUF19" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADC1BUF19" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="ADC1BUF19" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802240" edc:_begin="0x0" edc:_end="0x160" edc:_modsrc="DOS-02805_adc_sib_upb_v1_32bit.Module" edc:_refcount="1" edc:access="-nnn-----------------nnnnnnnnnnn" edc:cname="ADC1BUF20" edc:desc="" edc:impl="0x700007ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000-----------------00000000000" edc:name="ADC1BUF20" edc:nzwidth="0x20" edc:por="-000-----------------00000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADC1BUF20" edc:desc="" edc:islanghidden="true" edc:mask="0x700007ff" edc:name="ADC1BUF20" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802250" edc:_begin="0x0" edc:_end="0x160" edc:_modsrc="DOS-02805_adc_sib_upb_v1_32bit.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADC1BUF21" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADC1BUF21" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADC1BUF21" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="ADC1BUF21" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802260" edc:_begin="0x200" edc:_end="0x250" edc:_modsrc="DOS-02805_adc_sib_upb_v1_32bit.Module" edc:_refcount="2" edc:access="----------------nnn--nnnnnnnnnnc" edc:cname="AD1CON1" edc:desc="" edc:impl="0xffffe7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000--00000000000" edc:name="AD1CON1" edc:nzwidth="0x20" edc:por="----------------000--00000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DONE" edc:desc="" edc:mask="0x1" edc:name="DONE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SAMP" edc:desc="" edc:mask="0x1" edc:name="SAMP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ASAM" edc:desc="" edc:mask="0x1" edc:name="ASAM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE12" edc:desc="" edc:mask="0x1" edc:name="MODE12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SSRC" edc:desc="" edc:mask="0xf" edc:name="SSRC" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="FORM" edc:desc="" edc:mask="0x7" edc:name="FORM" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="ADC 1" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802270" edc:_begin="0x200" edc:_end="0x250" edc:_modsrc="DOS-02805_adc_sib_upb_v1_32bit.Module" edc:_refcount="2" edc:access="----------------nnnnnn--rnnnnnn-" edc:cname="AD1CON2" edc:desc="" edc:impl="0xfffffffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000000--0000000-" edc:name="AD1CON2" edc:nzwidth="0x20" edc:por="----------------000000--0000000-" edc:portals="CLR SET INV" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:access="" edc:id="DS.0" edc:mclr="" edc:por="">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="BUFM" edc:desc="" edc:mask="0x1" edc:name="BUFM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMPI" edc:mask="0x1f" edc:name="SMPI" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="BUFS" edc:desc="" edc:mask="0x1" edc:name="BUFS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="CSCNA" edc:desc="" edc:mask="0x1" edc:name="CSCNA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUFREGEN" edc:desc="" edc:mask="0x1" edc:name="BUFREGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OFFCAL" edc:desc="" edc:mask="0x1" edc:name="OFFCAL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VCFG" edc:desc="" edc:mask="0x7" edc:name="VCFG" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802280" edc:_begin="0x200" edc:_end="0x250" edc:_modsrc="DOS-02805_adc_sib_upb_v1_32bit.Module" edc:_refcount="2" edc:access="----------------nn-nnnnnnnnnnnnn" edc:cname="AD1CON3" edc:desc="" edc:impl="0xffffdfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00-0000000000000" edc:name="AD1CON3" edc:nzwidth="0x20" edc:por="----------------00-0000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCS" edc:desc="" edc:mask="0xff" edc:name="ADCS" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SAMC" edc:desc="" edc:mask="0x1f" edc:name="SAMC" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EXTSAM" edc:desc="" edc:mask="0x1" edc:name="EXTSAM" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADRC" edc:desc="" edc:mask="0x1" edc:name="ADRC" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
